#!/usr/bin/env ruby
# frozen_string_literal: true

# main
brew "antigen"
brew "fish"
brew "asdf"
brew "git"
brew "luajit", args: ["HEAD"]
brew "neovim", args: ["HEAD"]
# brew "macvim"
brew "rubyfmt"
brew "perl"

# hack font with icons
tap "homebrew/cask-fonts"
cask "font-hack-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-hasklig"
cask "font-inter"

# tools
brew "awscli"
brew "bandwhich"
brew "bat"
brew "coreutils"
brew "ctags"
brew "dark-mode"
brew "direnv"
brew "dust"
brew "exa"
brew "fd"
brew "fzf"
brew "gh"
brew "gping"
brew "graphviz"
brew "grex"
brew "hyperfine"
brew "jq"
brew "jsonlint"
brew "libmaxminddb"
brew "markdownlint-cli"
brew "nmap"
brew "par"
brew "pre-commit"
brew "prettier"
brew "procs"
brew "readline"
brew "ripgrep"
brew "sd"
brew "siege"
brew "silicon"
brew "starship"
# brew "tealdear"
brew "tmux"
brew "tmuxinator"
brew "tokei"
brew "tree"
brew "watch"
brew "wget"
# brew "ytop"
brew "zoxide"

# fun
brew "cowsay"
brew "fortune"
brew "gti"
brew "sl"

brew "h2o"
brew "mkcert"
brew "nss"

# databases
brew "memcached",  restart_service: :changed
brew "postgresql", restart_service: :changed
brew "redis",      restart_service: :changed
brew "sqlite"

# tap "elastic/tap"
# brew "elastic/tap/elasticsearch-full", restart_service: :changed
