#!/usr/bin/env ruby
# frozen_string_literal: true

# main
brew "antigen"
brew "fish"
# brew "nushell"
brew "asdf"
brew "git"
brew "luajit" # , args: ["HEAD"]
brew "neovim" # , args: ["HEAD"]
# brew "macvim"
brew "rubyfmt"
brew "perl"

# hack font with icons
# tap "homebrew/cask-fonts"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-agave-nerd-font"
cask "font-inter"
cask "font-jetbrains-mono-nerd-font"

# tools
brew "awscli"
brew "bandwhich"
brew "bat"
brew "bat-extras"
brew "coreutils"
brew "ctags"
brew "dark-mode"
brew "direnv"
brew "dust"
brew "entr"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git-delta"
brew "gping"
brew "graphviz"
brew "grex"
brew "hyperfine"
brew "jq"
brew "jsonlint"
brew "kubernetes-cli"
brew "libmaxminddb"
brew "markdownlint-cli"
brew "nmap"
brew "par"
brew "pre-commit"
brew "prettier"
brew "procs"
brew "readline"
brew "ripgrep"
brew "sd"
brew "siege"
brew "silicon"
brew "starship"
brew "tmux"
brew "tmuxinator"
brew "tokei"
brew "tree"
brew "watch"
brew "wget"
brew "yq"
brew "zoxide"

# fun
brew "cowsay"
brew "fortune"
brew "gti"
brew "sl"

brew "mkcert"
brew "nss"

# databases
brew "memcached",     restart_service: :changed
brew "postgresql@16", restart_service: :changed
brew "redis",         restart_service: :changed
brew "sqlite"

# tap "elastic/tap"
# brew "elastic/tap/elasticsearch-full", restart_service: :changed
